{
  "banner": "https://raw.githubusercontent.com/ZeTro-dev/portfolio/main/.assets/projects/cafedesdevs/cover.png",
  "name": "Café Des Devs",
  "url": "cafe-des-devs",
  "date": "2022-10-31",
  "tags": [
    "Charte Graphique",
    "Projets"
  ],
  "contents": [
    {
      "type": "Title",
      "title": "Café Des Devs",
      "description": "Le Café Des Devs est une communauté en ligne pour les développeurs qui cherchent à s'entraider et à partager leurs connaissances.",
      "tags": [
        "Charte Graphique",
        "Projets"

      ],
      "icon": "https://raw.githubusercontent.com/ZeTro-dev/portfolio/main/.assets/projects/cafedesdevs/logo.png"
    },
    {
      "type": "BasicText",
      "title": "Ce qu'il faut savoir de Café Des Devs",
      "text": "Le Café Des Devs est une communauté en ligne pour les développeurs qui cherchent à s'entraider et à partager leurs connaissances. Créé le 23 janvier 2021 par zetro, ce projet a connu une croissance rapide depuis son lancement. Aujourd'hui, le Café Des Devs compte plus de 1500 membres sur son serveur Discord, ce qui en fait l'une des communautés de développement les plus actives et les plus dynamiques sur le web. Que vous cherchiez des conseils, des ressources ou simplement un endroit pour discuter avec d'autres développeurs passionnés, le Café Des Devs est l'endroit idéal pour vous."
    },
    {
      "type": "BigImageText",
      "title": "Nos Mascottes",
      "text": "Nous avions choisi de représenter la communauté des développeurs à travers des petites mascottes de café. Ces emotes de café ont été créées pour représenter les différentes expressions de la communauté, allant de la joie à la frustration en passant par la concentration. Le choix des emotes de café n'est pas anodin. Tout d'abord, cela représente le nom de la communauté. Mais en plus de cela, les développeurs sont souvent associés à la consommation de café, ce qui rend ces mascottes encore plus représentatives de la communauté. Les emotes de café sont devenues une partie intégrante de l'identité visuelle de Café Des Devs et sont utilisées pour exprimer les émotions lors des conversations en ligne.",
      "image": "https://raw.githubusercontent.com/ZeTro-dev/portfolio/main/.assets/projects/cafedesdevs/emotes.png"
    },
    {
      "type": "Warning",
      "title": "Tout droits réservés",
      "text": "Toutes les créations associées à Café Des Devs, y compris les logos, les emotes, les bannières, les documents et autres contenus, sont protégées par une licence de propriété intellectuelle. Toute utilisation de ces créations à des fins commerciales sans l'autorisation explicite de Café Des Devs est strictement interdite et peut entraîner des poursuites judiciaires. Nous prenons la protection de nos créations très au sérieux et nous nous réservons le droit de prendre les mesures légales appropriées pour protéger nos droits de propriété intellectuelle. Nous invitons les personnes intéressées à utiliser nos créations à nous contacter à cette adresse : contact@cafedesdevs.fr pour obtenir l'autorisation nécessaire."
    },
    {
      "type": "ImageText",
      "title": "Dev-Conquest",
      "text": "Le \"Dev-Conquest\" est un concours de programmation organisé par le Café Des Devs, une communauté en ligne pour les développeurs. Les participants ont l'opportunité de relever des défis stimulants, quel que soit leur niveau de compétence ou leur langage de programmation. Des prix incroyables sont offerts grâce à la générosité des sponsors impliqués dans l'événement. Les développeurs peuvent rejoindre ce concours pour tester leurs compétences et tenter de gagner des cadeaux fantastiques. C'est une occasion de se mesurer aux autres développeurs et de se faire remarquer par les sponsors.",
      "image": "https://raw.githubusercontent.com/ZeTro-dev/portfolio/main/.assets/projects/cafedesdevs/dev-conquest.png"
    },
    {
      "type": "Contributor",
      "title": "Les créateurs",
      "contributors": [
        {
          "icon": "https://raw.githubusercontent.com/ZeTro-dev/portfolio/main/.assets/contributeurs/zetro.png",
          "name": "Zetro",
          "tags": [
            "Propriétaire"
          ]
        },
        {
          "icon": "https://raw.githubusercontent.com/ZeTro-dev/portfolio/main/.assets/letter/letter_o.png",
          "name": "Oneil Walsh",
          "tags": [
            "Fondateur"
          ]
        }
      ]
    },
    {
      "type": "ExternalLinks",
      "title": "Découvrez leurs réseaux ci-dessous",
      "links": [
        {
          "icon": "https://raw.githubusercontent.com/ZeTro-dev/portfolio/main/.assets/icons/link.png",
          "name": "Site Web",
          "link": "https://cafedesdevs.fr"
        },
        {
          "icon": "https://raw.githubusercontent.com/ZeTro-dev/portfolio/main/.assets/icons/discord.png",
          "name": "Discord",
          "link": "https://discord.gg/cafedesdevs"
        }
      ]
    }
  ]
}
